src/main/java/com/smalljetty/requests/SpidQueryService2_Request2.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Header xmlns:wsa="http://www.w3.org/2005/08/addressing">
        <wsa:To>http://zu-test-zf-cne-01.pnet.ch:8081/wsproxy/services/SpidQueryService2/</wsa:To>
        <wsa:MessageID>urn:uuid:957da1c3-8ade-4a24-9f92-639a63275f37</wsa:MessageID>
        <wsa:Action>http://www.zas.admin.ch</wsa:Action>
        <sense:context xmlns:sense="http://sense.ith-icoserve.com/context/"
                       xmlns:wsctx="http://docs.oasis-open.org/ws-caf/2005/10/wsctx">
            <wsctx:context-identifier>urn:uuid:9042f18e-01ad-40c5-bd5e-b326d98e6d22</wsctx:context-identifier>
            <wsctx:context-service>
                <sense:service>UPIProxy</sense:service>
            </wsctx:context-service>
        </sense:context>
    </soapenv:Header>
    <soapenv:Body>
        <ns8:request xmlns:ns8="http://www.ech.ch/xmlns/eCH-0214/2"
                     xmlns:ns13="http://www.ech.ch/xmlns/eCH-0006/2"
                     xmlns:ns12="http://www.ech.ch/xmlns/eCH-0135/1"
                     xmlns:ns11="http://www.ech.ch/xmlns/eCH-0213/1"
                     xmlns:ns10="http://www.ech.ch/xmlns/eCH-0215/2"
                     xmlns:ns9="http://www.ech.ch/xmlns/eCH-0021/7"
                     xmlns:ns7="http://www.ech.ch/xmlns/eCH-0213-commons/1"
                     xmlns:ns6="http://www.ech.ch/xmlns/eCH-0010/5"
                     xmlns:ns5="http://www.ech.ch/xmlns/eCH-0008/3"
                     xmlns:ns4="http://www.ech.ch/xmlns/eCH-0007/5"
                     xmlns:ns3="http://www.ech.ch/xmlns/eCH-0011/8"
                     xmlns:ns2="http://www.ech.ch/xmlns/eCH-0044/4"
                     xmlns="http://www.ech.ch/xmlns/eCH-0058/5"
                     minorVersion="0">
            <ns8:header>
                <senderId>sedex://T4-321574-2</senderId>
                <recipientId>sedex://T3-CH-24</recipientId>
                <messageId>559f64d63aee4c4ead5e501901b5729f</messageId>
                <messageType>1021</messageType>
                <sendingApplication>
                    <manufacturer>ITH icoserve</manufacturer>
                    <product>eHealth Solutions</product>
                    <productVersion>VA37</productVersion>
                </sendingApplication>
                <messageDate>2020-01-14T09:25:46.413+01:00</messageDate>
                <action>5</action>
                <testDeliveryFlag>true</testDeliveryFlag>
                <responseExpected>true</responseExpected>
            </ns8:header>
            <ns8:content>
                <ns8:SPIDCategory>EPD-ID.BAG.ADMIN.CH</ns8:SPIDCategory>
                <ns8:responseLanguage>EN</ns8:responseLanguage>
                <ns8:getInfoPersonRequest>
                    <ns8:getInfoPersonRequestId>1</ns8:getInfoPersonRequestId>
                    <ns8:detailLevelOfResponse>standard</ns8:detailLevelOfResponse>
                    <ns8:pid>
                        <ns8:SPID>761337615550302569</ns8:SPID>
                    </ns8:pid>
                </ns8:getInfoPersonRequest>
            </ns8:content>
        </ns8:request>
    </soapenv:Body>
</soapenv:Envelope>